HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxBmu_bf.h
/** \\brief  Length for Ifx_BMU_FMSTS_Bits.OVF_STS */
#define IFX_BMU_FMSTS_OVF_STS_LEN (1)

/** \\brief  Mask for Ifx_BMU_FMSTS_Bits.OVF_STS */
#define IFX_BMU_FMSTS_OVF_STS_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_FMSTS_Bits.OVF_STS */
#define IFX_BMU_FMSTS_OVF_STS_OFF (1)

/** \\brief  Length for Ifx_BMU_FMSTS_Bits.UDF_STS */
#define IFX_BMU_FMSTS_UDF_STS_LEN (1)

/** \\brief  Mask for Ifx_BMU_FMSTS_Bits.UDF_STS */
#define IFX_BMU_FMSTS_UDF_STS_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_FMSTS_Bits.UDF_STS */
#define IFX_BMU_FMSTS_UDF_STS_OFF (2)

/** \\brief  Length for Ifx_BMU_FMTH_Bits.FHT */
#define IFX_BMU_FMTH_FHT_LEN (8)

/** \\brief  Mask for Ifx_BMU_FMTH_Bits.FHT */
#define IFX_BMU_FMTH_FHT_MSK (0xff)

/** \\brief  Offset for Ifx_BMU_FMTH_Bits.FHT */
#define IFX_BMU_FMTH_FHT_OFF (0)

/** \\brief  Length for Ifx_BMU_FULLNESS_Bits.FCELLS */
#define IFX_BMU_FULLNESS_FCELLS_LEN (9)

/** \\brief  Mask for Ifx_BMU_FULLNESS_Bits.FCELLS */
#define IFX_BMU_FULLNESS_FCELLS_MSK (0x1ff)

/** \\brief  Offset for Ifx_BMU_FULLNESS_Bits.FCELLS */
#define IFX_BMU_FULLNESS_FCELLS_OFF (16)

/** \\brief  Length for Ifx_BMU_FULLNESS_Bits.UCELLS */
#define IFX_BMU_FULLNESS_UCELLS_LEN (9)

/** \\brief  Mask for Ifx_BMU_FULLNESS_Bits.UCELLS */
#define IFX_BMU_FULLNESS_UCELLS_MSK (0x1ff)

/** \\brief  Offset for Ifx_BMU_FULLNESS_Bits.UCELLS */
#define IFX_BMU_FULLNESS_UCELLS_OFF (0)

/** \\brief  Length for Ifx_BMU_ID_Bits.MODNUMBER */
#define IFX_BMU_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_BMU_ID_Bits.MODNUMBER */
#define IFX_BMU_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_BMU_ID_Bits.MODNUMBER */
#define IFX_BMU_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_BMU_ID_Bits.MODREV */
#define IFX_BMU_ID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_BMU_ID_Bits.MODREV */
#define IFX_BMU_ID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_BMU_ID_Bits.MODREV */
#define IFX_BMU_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_BMU_ID_Bits.MODTYPE */
#define IFX_BMU_ID_MODTYPE_LEN (8)

/** \\brief  Mask for Ifx_BMU_ID_Bits.MODTYPE */
#define IFX_BMU_ID_MODTYPE_MSK (0xff)

/** \\brief  Offset for Ifx_BMU_ID_Bits.MODTYPE */
#define IFX_BMU_ID_MODTYPE_OFF (8)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL0 */
#define IFX_BMU_PSET0_FPI_SEL0_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL0 */
#define IFX_BMU_PSET0_FPI_SEL0_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL0 */
#define IFX_BMU_PSET0_FPI_SEL0_OFF (0)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL10 */
#define IFX_BMU_PSET0_FPI_SEL10_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL10 */
#define IFX_BMU_PSET0_FPI_SEL10_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL10 */
#define IFX_BMU_PSET0_FPI_SEL10_OFF (10)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL11 */
#define IFX_BMU_PSET0_FPI_SEL11_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL11 */
#define IFX_BMU_PSET0_FPI_SEL11_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL11 */
#define IFX_BMU_PSET0_FPI_SEL11_OFF (11)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL12 */
#define IFX_BMU_PSET0_FPI_SEL12_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL12 */
#define IFX_BMU_PSET0_FPI_SEL12_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL12 */
#define IFX_BMU_PSET0_FPI_SEL12_OFF (12)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL13 */
#define IFX_BMU_PSET0_FPI_SEL13_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL13 */
#define IFX_BMU_PSET0_FPI_SEL13_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL13 */
#define IFX_BMU_PSET0_FPI_SEL13_OFF (13)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL14 */
#define IFX_BMU_PSET0_FPI_SEL14_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL14 */
#define IFX_BMU_PSET0_FPI_SEL14_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL14 */
#define IFX_BMU_PSET0_FPI_SEL14_OFF (14)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL15 */
#define IFX_BMU_PSET0_FPI_SEL15_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL15 */
#define IFX_BMU_PSET0_FPI_SEL15_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL15 */
#define IFX_BMU_PSET0_FPI_SEL15_OFF (15)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL16 */
#define IFX_BMU_PSET0_FPI_SEL16_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL16 */
#define IFX_BMU_PSET0_FPI_SEL16_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL16 */
#define IFX_BMU_PSET0_FPI_SEL16_OFF (16)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL17 */
#define IFX_BMU_PSET0_FPI_SEL17_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL17 */
#define IFX_BMU_PSET0_FPI_SEL17_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL17 */
#define IFX_BMU_PSET0_FPI_SEL17_OFF (17)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL18 */
#define IFX_BMU_PSET0_FPI_SEL18_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL18 */
#define IFX_BMU_PSET0_FPI_SEL18_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL18 */
#define IFX_BMU_PSET0_FPI_SEL18_OFF (18)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL19 */
#define IFX_BMU_PSET0_FPI_SEL19_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL19 */
#define IFX_BMU_PSET0_FPI_SEL19_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL19 */
#define IFX_BMU_PSET0_FPI_SEL19_OFF (19)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL1 */
#define IFX_BMU_PSET0_FPI_SEL1_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL1 */
#define IFX_BMU_PSET0_FPI_SEL1_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL1 */
#define IFX_BMU_PSET0_FPI_SEL1_OFF (1)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL20 */
#define IFX_BMU_PSET0_FPI_SEL20_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL20 */
#define IFX_BMU_PSET0_FPI_SEL20_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL20 */
#define IFX_BMU_PSET0_FPI_SEL20_OFF (20)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL21 */
#define IFX_BMU_PSET0_FPI_SEL21_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL21 */
#define IFX_BMU_PSET0_FPI_SEL21_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL21 */
#define IFX_BMU_PSET0_FPI_SEL21_OFF (21)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL22 */
#define IFX_BMU_PSET0_FPI_SEL22_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL22 */
#define IFX_BMU_PSET0_FPI_SEL22_MSK (0x1)

