HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxBmu_bf.h
/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL22 */
#define IFX_BMU_PSET0_FPI_SEL22_OFF (22)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL23 */
#define IFX_BMU_PSET0_FPI_SEL23_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL23 */
#define IFX_BMU_PSET0_FPI_SEL23_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL23 */
#define IFX_BMU_PSET0_FPI_SEL23_OFF (23)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL24 */
#define IFX_BMU_PSET0_FPI_SEL24_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL24 */
#define IFX_BMU_PSET0_FPI_SEL24_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL24 */
#define IFX_BMU_PSET0_FPI_SEL24_OFF (24)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL25 */
#define IFX_BMU_PSET0_FPI_SEL25_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL25 */
#define IFX_BMU_PSET0_FPI_SEL25_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL25 */
#define IFX_BMU_PSET0_FPI_SEL25_OFF (25)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL26 */
#define IFX_BMU_PSET0_FPI_SEL26_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL26 */
#define IFX_BMU_PSET0_FPI_SEL26_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL26 */
#define IFX_BMU_PSET0_FPI_SEL26_OFF (26)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL27 */
#define IFX_BMU_PSET0_FPI_SEL27_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL27 */
#define IFX_BMU_PSET0_FPI_SEL27_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL27 */
#define IFX_BMU_PSET0_FPI_SEL27_OFF (27)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL28 */
#define IFX_BMU_PSET0_FPI_SEL28_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL28 */
#define IFX_BMU_PSET0_FPI_SEL28_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL28 */
#define IFX_BMU_PSET0_FPI_SEL28_OFF (28)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL29 */
#define IFX_BMU_PSET0_FPI_SEL29_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL29 */
#define IFX_BMU_PSET0_FPI_SEL29_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL29 */
#define IFX_BMU_PSET0_FPI_SEL29_OFF (29)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL2 */
#define IFX_BMU_PSET0_FPI_SEL2_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL2 */
#define IFX_BMU_PSET0_FPI_SEL2_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL2 */
#define IFX_BMU_PSET0_FPI_SEL2_OFF (2)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL30 */
#define IFX_BMU_PSET0_FPI_SEL30_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL30 */
#define IFX_BMU_PSET0_FPI_SEL30_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL30 */
#define IFX_BMU_PSET0_FPI_SEL30_OFF (30)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL31 */
#define IFX_BMU_PSET0_FPI_SEL31_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL31 */
#define IFX_BMU_PSET0_FPI_SEL31_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL31 */
#define IFX_BMU_PSET0_FPI_SEL31_OFF (31)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL3 */
#define IFX_BMU_PSET0_FPI_SEL3_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL3 */
#define IFX_BMU_PSET0_FPI_SEL3_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL3 */
#define IFX_BMU_PSET0_FPI_SEL3_OFF (3)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL4 */
#define IFX_BMU_PSET0_FPI_SEL4_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL4 */
#define IFX_BMU_PSET0_FPI_SEL4_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL4 */
#define IFX_BMU_PSET0_FPI_SEL4_OFF (4)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL5 */
#define IFX_BMU_PSET0_FPI_SEL5_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL5 */
#define IFX_BMU_PSET0_FPI_SEL5_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL5 */
#define IFX_BMU_PSET0_FPI_SEL5_OFF (5)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL6 */
#define IFX_BMU_PSET0_FPI_SEL6_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL6 */
#define IFX_BMU_PSET0_FPI_SEL6_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL6 */
#define IFX_BMU_PSET0_FPI_SEL6_OFF (6)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL7 */
#define IFX_BMU_PSET0_FPI_SEL7_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL7 */
#define IFX_BMU_PSET0_FPI_SEL7_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL7 */
#define IFX_BMU_PSET0_FPI_SEL7_OFF (7)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL8 */
#define IFX_BMU_PSET0_FPI_SEL8_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL8 */
#define IFX_BMU_PSET0_FPI_SEL8_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL8 */
#define IFX_BMU_PSET0_FPI_SEL8_OFF (8)

/** \\brief  Length for Ifx_BMU_PSET0_Bits.FPI_SEL9 */
#define IFX_BMU_PSET0_FPI_SEL9_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET0_Bits.FPI_SEL9 */
#define IFX_BMU_PSET0_FPI_SEL9_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET0_Bits.FPI_SEL9 */
#define IFX_BMU_PSET0_FPI_SEL9_OFF (9)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL32 */
#define IFX_BMU_PSET1_FPI_SEL32_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL32 */
#define IFX_BMU_PSET1_FPI_SEL32_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL32 */
#define IFX_BMU_PSET1_FPI_SEL32_OFF (0)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL33 */
#define IFX_BMU_PSET1_FPI_SEL33_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL33 */
#define IFX_BMU_PSET1_FPI_SEL33_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL33 */
#define IFX_BMU_PSET1_FPI_SEL33_OFF (1)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL34 */
#define IFX_BMU_PSET1_FPI_SEL34_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL34 */
#define IFX_BMU_PSET1_FPI_SEL34_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL34 */
#define IFX_BMU_PSET1_FPI_SEL34_OFF (2)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL35 */
#define IFX_BMU_PSET1_FPI_SEL35_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL35 */
#define IFX_BMU_PSET1_FPI_SEL35_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL35 */
#define IFX_BMU_PSET1_FPI_SEL35_OFF (3)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL36 */
#define IFX_BMU_PSET1_FPI_SEL36_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL36 */
#define IFX_BMU_PSET1_FPI_SEL36_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL36 */
#define IFX_BMU_PSET1_FPI_SEL36_OFF (4)

