HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxBmu_bf.h
/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL37 */
#define IFX_BMU_PSET1_FPI_SEL37_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL37 */
#define IFX_BMU_PSET1_FPI_SEL37_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL37 */
#define IFX_BMU_PSET1_FPI_SEL37_OFF (5)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL38 */
#define IFX_BMU_PSET1_FPI_SEL38_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL38 */
#define IFX_BMU_PSET1_FPI_SEL38_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL38 */
#define IFX_BMU_PSET1_FPI_SEL38_OFF (6)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL39 */
#define IFX_BMU_PSET1_FPI_SEL39_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL39 */
#define IFX_BMU_PSET1_FPI_SEL39_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL39 */
#define IFX_BMU_PSET1_FPI_SEL39_OFF (7)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL40 */
#define IFX_BMU_PSET1_FPI_SEL40_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL40 */
#define IFX_BMU_PSET1_FPI_SEL40_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL40 */
#define IFX_BMU_PSET1_FPI_SEL40_OFF (8)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL41 */
#define IFX_BMU_PSET1_FPI_SEL41_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL41 */
#define IFX_BMU_PSET1_FPI_SEL41_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL41 */
#define IFX_BMU_PSET1_FPI_SEL41_OFF (9)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL42 */
#define IFX_BMU_PSET1_FPI_SEL42_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL42 */
#define IFX_BMU_PSET1_FPI_SEL42_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL42 */
#define IFX_BMU_PSET1_FPI_SEL42_OFF (10)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL43 */
#define IFX_BMU_PSET1_FPI_SEL43_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL43 */
#define IFX_BMU_PSET1_FPI_SEL43_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL43 */
#define IFX_BMU_PSET1_FPI_SEL43_OFF (11)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL44 */
#define IFX_BMU_PSET1_FPI_SEL44_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL44 */
#define IFX_BMU_PSET1_FPI_SEL44_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL44 */
#define IFX_BMU_PSET1_FPI_SEL44_OFF (12)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL45 */
#define IFX_BMU_PSET1_FPI_SEL45_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL45 */
#define IFX_BMU_PSET1_FPI_SEL45_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL45 */
#define IFX_BMU_PSET1_FPI_SEL45_OFF (13)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL46 */
#define IFX_BMU_PSET1_FPI_SEL46_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL46 */
#define IFX_BMU_PSET1_FPI_SEL46_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL46 */
#define IFX_BMU_PSET1_FPI_SEL46_OFF (14)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL47 */
#define IFX_BMU_PSET1_FPI_SEL47_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL47 */
#define IFX_BMU_PSET1_FPI_SEL47_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL47 */
#define IFX_BMU_PSET1_FPI_SEL47_OFF (15)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL48 */
#define IFX_BMU_PSET1_FPI_SEL48_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL48 */
#define IFX_BMU_PSET1_FPI_SEL48_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL48 */
#define IFX_BMU_PSET1_FPI_SEL48_OFF (16)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL49 */
#define IFX_BMU_PSET1_FPI_SEL49_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL49 */
#define IFX_BMU_PSET1_FPI_SEL49_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL49 */
#define IFX_BMU_PSET1_FPI_SEL49_OFF (17)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL50 */
#define IFX_BMU_PSET1_FPI_SEL50_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL50 */
#define IFX_BMU_PSET1_FPI_SEL50_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL50 */
#define IFX_BMU_PSET1_FPI_SEL50_OFF (18)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL51 */
#define IFX_BMU_PSET1_FPI_SEL51_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL51 */
#define IFX_BMU_PSET1_FPI_SEL51_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL51 */
#define IFX_BMU_PSET1_FPI_SEL51_OFF (19)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL52 */
#define IFX_BMU_PSET1_FPI_SEL52_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL52 */
#define IFX_BMU_PSET1_FPI_SEL52_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL52 */
#define IFX_BMU_PSET1_FPI_SEL52_OFF (20)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL53 */
#define IFX_BMU_PSET1_FPI_SEL53_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL53 */
#define IFX_BMU_PSET1_FPI_SEL53_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL53 */
#define IFX_BMU_PSET1_FPI_SEL53_OFF (21)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL54 */
#define IFX_BMU_PSET1_FPI_SEL54_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL54 */
#define IFX_BMU_PSET1_FPI_SEL54_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL54 */
#define IFX_BMU_PSET1_FPI_SEL54_OFF (22)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL55 */
#define IFX_BMU_PSET1_FPI_SEL55_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL55 */
#define IFX_BMU_PSET1_FPI_SEL55_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL55 */
#define IFX_BMU_PSET1_FPI_SEL55_OFF (23)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL56 */
#define IFX_BMU_PSET1_FPI_SEL56_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL56 */
#define IFX_BMU_PSET1_FPI_SEL56_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL56 */
#define IFX_BMU_PSET1_FPI_SEL56_OFF (24)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL57 */
#define IFX_BMU_PSET1_FPI_SEL57_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL57 */
#define IFX_BMU_PSET1_FPI_SEL57_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL57 */
#define IFX_BMU_PSET1_FPI_SEL57_OFF (25)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL58 */
#define IFX_BMU_PSET1_FPI_SEL58_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL58 */
#define IFX_BMU_PSET1_FPI_SEL58_MSK (0x1)

