HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxBmu_bf.h
/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL58 */
#define IFX_BMU_PSET1_FPI_SEL58_OFF (26)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL59 */
#define IFX_BMU_PSET1_FPI_SEL59_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL59 */
#define IFX_BMU_PSET1_FPI_SEL59_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL59 */
#define IFX_BMU_PSET1_FPI_SEL59_OFF (27)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL60 */
#define IFX_BMU_PSET1_FPI_SEL60_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL60 */
#define IFX_BMU_PSET1_FPI_SEL60_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL60 */
#define IFX_BMU_PSET1_FPI_SEL60_OFF (28)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL61 */
#define IFX_BMU_PSET1_FPI_SEL61_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL61 */
#define IFX_BMU_PSET1_FPI_SEL61_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL61 */
#define IFX_BMU_PSET1_FPI_SEL61_OFF (29)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL62 */
#define IFX_BMU_PSET1_FPI_SEL62_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL62 */
#define IFX_BMU_PSET1_FPI_SEL62_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL62 */
#define IFX_BMU_PSET1_FPI_SEL62_OFF (30)

/** \\brief  Length for Ifx_BMU_PSET1_Bits.FPI_SEL63 */
#define IFX_BMU_PSET1_FPI_SEL63_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET1_Bits.FPI_SEL63 */
#define IFX_BMU_PSET1_FPI_SEL63_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET1_Bits.FPI_SEL63 */
#define IFX_BMU_PSET1_FPI_SEL63_OFF (31)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL64 */
#define IFX_BMU_PSET2_FPI_SEL64_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL64 */
#define IFX_BMU_PSET2_FPI_SEL64_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL64 */
#define IFX_BMU_PSET2_FPI_SEL64_OFF (0)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL65 */
#define IFX_BMU_PSET2_FPI_SEL65_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL65 */
#define IFX_BMU_PSET2_FPI_SEL65_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL65 */
#define IFX_BMU_PSET2_FPI_SEL65_OFF (1)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL66 */
#define IFX_BMU_PSET2_FPI_SEL66_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL66 */
#define IFX_BMU_PSET2_FPI_SEL66_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL66 */
#define IFX_BMU_PSET2_FPI_SEL66_OFF (2)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL67 */
#define IFX_BMU_PSET2_FPI_SEL67_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL67 */
#define IFX_BMU_PSET2_FPI_SEL67_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL67 */
#define IFX_BMU_PSET2_FPI_SEL67_OFF (3)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL68 */
#define IFX_BMU_PSET2_FPI_SEL68_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL68 */
#define IFX_BMU_PSET2_FPI_SEL68_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL68 */
#define IFX_BMU_PSET2_FPI_SEL68_OFF (4)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL69 */
#define IFX_BMU_PSET2_FPI_SEL69_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL69 */
#define IFX_BMU_PSET2_FPI_SEL69_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL69 */
#define IFX_BMU_PSET2_FPI_SEL69_OFF (5)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL70 */
#define IFX_BMU_PSET2_FPI_SEL70_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL70 */
#define IFX_BMU_PSET2_FPI_SEL70_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL70 */
#define IFX_BMU_PSET2_FPI_SEL70_OFF (6)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL71 */
#define IFX_BMU_PSET2_FPI_SEL71_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL71 */
#define IFX_BMU_PSET2_FPI_SEL71_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL71 */
#define IFX_BMU_PSET2_FPI_SEL71_OFF (7)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL72 */
#define IFX_BMU_PSET2_FPI_SEL72_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL72 */
#define IFX_BMU_PSET2_FPI_SEL72_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL72 */
#define IFX_BMU_PSET2_FPI_SEL72_OFF (8)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL73 */
#define IFX_BMU_PSET2_FPI_SEL73_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL73 */
#define IFX_BMU_PSET2_FPI_SEL73_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL73 */
#define IFX_BMU_PSET2_FPI_SEL73_OFF (9)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL74 */
#define IFX_BMU_PSET2_FPI_SEL74_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL74 */
#define IFX_BMU_PSET2_FPI_SEL74_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL74 */
#define IFX_BMU_PSET2_FPI_SEL74_OFF (10)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL75 */
#define IFX_BMU_PSET2_FPI_SEL75_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL75 */
#define IFX_BMU_PSET2_FPI_SEL75_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL75 */
#define IFX_BMU_PSET2_FPI_SEL75_OFF (11)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL76 */
#define IFX_BMU_PSET2_FPI_SEL76_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL76 */
#define IFX_BMU_PSET2_FPI_SEL76_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL76 */
#define IFX_BMU_PSET2_FPI_SEL76_OFF (12)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL77 */
#define IFX_BMU_PSET2_FPI_SEL77_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL77 */
#define IFX_BMU_PSET2_FPI_SEL77_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL77 */
#define IFX_BMU_PSET2_FPI_SEL77_OFF (13)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL78 */
#define IFX_BMU_PSET2_FPI_SEL78_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL78 */
#define IFX_BMU_PSET2_FPI_SEL78_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL78 */
#define IFX_BMU_PSET2_FPI_SEL78_OFF (14)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL79 */
#define IFX_BMU_PSET2_FPI_SEL79_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL79 */
#define IFX_BMU_PSET2_FPI_SEL79_MSK (0x1)

