HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxBmu_bf.h
/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL79 */
#define IFX_BMU_PSET2_FPI_SEL79_OFF (15)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL80 */
#define IFX_BMU_PSET2_FPI_SEL80_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL80 */
#define IFX_BMU_PSET2_FPI_SEL80_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL80 */
#define IFX_BMU_PSET2_FPI_SEL80_OFF (16)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL81 */
#define IFX_BMU_PSET2_FPI_SEL81_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL81 */
#define IFX_BMU_PSET2_FPI_SEL81_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL81 */
#define IFX_BMU_PSET2_FPI_SEL81_OFF (17)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL82 */
#define IFX_BMU_PSET2_FPI_SEL82_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL82 */
#define IFX_BMU_PSET2_FPI_SEL82_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL82 */
#define IFX_BMU_PSET2_FPI_SEL82_OFF (18)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL83 */
#define IFX_BMU_PSET2_FPI_SEL83_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL83 */
#define IFX_BMU_PSET2_FPI_SEL83_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL83 */
#define IFX_BMU_PSET2_FPI_SEL83_OFF (19)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL84 */
#define IFX_BMU_PSET2_FPI_SEL84_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL84 */
#define IFX_BMU_PSET2_FPI_SEL84_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL84 */
#define IFX_BMU_PSET2_FPI_SEL84_OFF (20)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL85 */
#define IFX_BMU_PSET2_FPI_SEL85_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL85 */
#define IFX_BMU_PSET2_FPI_SEL85_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL85 */
#define IFX_BMU_PSET2_FPI_SEL85_OFF (21)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL86 */
#define IFX_BMU_PSET2_FPI_SEL86_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL86 */
#define IFX_BMU_PSET2_FPI_SEL86_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL86 */
#define IFX_BMU_PSET2_FPI_SEL86_OFF (22)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL87 */
#define IFX_BMU_PSET2_FPI_SEL87_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL87 */
#define IFX_BMU_PSET2_FPI_SEL87_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL87 */
#define IFX_BMU_PSET2_FPI_SEL87_OFF (23)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL88 */
#define IFX_BMU_PSET2_FPI_SEL88_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL88 */
#define IFX_BMU_PSET2_FPI_SEL88_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL88 */
#define IFX_BMU_PSET2_FPI_SEL88_OFF (24)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL89 */
#define IFX_BMU_PSET2_FPI_SEL89_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL89 */
#define IFX_BMU_PSET2_FPI_SEL89_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL89 */
#define IFX_BMU_PSET2_FPI_SEL89_OFF (25)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL90 */
#define IFX_BMU_PSET2_FPI_SEL90_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL90 */
#define IFX_BMU_PSET2_FPI_SEL90_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL90 */
#define IFX_BMU_PSET2_FPI_SEL90_OFF (26)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL91 */
#define IFX_BMU_PSET2_FPI_SEL91_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL91 */
#define IFX_BMU_PSET2_FPI_SEL91_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL91 */
#define IFX_BMU_PSET2_FPI_SEL91_OFF (27)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL92 */
#define IFX_BMU_PSET2_FPI_SEL92_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL92 */
#define IFX_BMU_PSET2_FPI_SEL92_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL92 */
#define IFX_BMU_PSET2_FPI_SEL92_OFF (28)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL93 */
#define IFX_BMU_PSET2_FPI_SEL93_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL93 */
#define IFX_BMU_PSET2_FPI_SEL93_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL93 */
#define IFX_BMU_PSET2_FPI_SEL93_OFF (29)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL94 */
#define IFX_BMU_PSET2_FPI_SEL94_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL94 */
#define IFX_BMU_PSET2_FPI_SEL94_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL94 */
#define IFX_BMU_PSET2_FPI_SEL94_OFF (30)

/** \\brief  Length for Ifx_BMU_PSET2_Bits.FPI_SEL95 */
#define IFX_BMU_PSET2_FPI_SEL95_LEN (1)

/** \\brief  Mask for Ifx_BMU_PSET2_Bits.FPI_SEL95 */
#define IFX_BMU_PSET2_FPI_SEL95_MSK (0x1)

/** \\brief  Offset for Ifx_BMU_PSET2_Bits.FPI_SEL95 */
#define IFX_BMU_PSET2_FPI_SEL95_OFF (31)

/** \\brief  Length for Ifx_BMU_PTR_Bits.RPTR */
#define IFX_BMU_PTR_RPTR_LEN (8)

/** \\brief  Mask for Ifx_BMU_PTR_Bits.RPTR */
#define IFX_BMU_PTR_RPTR_MSK (0xff)

/** \\brief  Offset for Ifx_BMU_PTR_Bits.RPTR */
#define IFX_BMU_PTR_RPTR_OFF (0)

/** \\brief  Length for Ifx_BMU_PTR_Bits.WPTR */
#define IFX_BMU_PTR_WPTR_LEN (8)

/** \\brief  Mask for Ifx_BMU_PTR_Bits.WPTR */
#define IFX_BMU_PTR_WPTR_MSK (0xff)

/** \\brief  Offset for Ifx_BMU_PTR_Bits.WPTR */
#define IFX_BMU_PTR_WPTR_OFF (16)

/** \\brief  Length for Ifx_BMU_TID_Bits.TID0 */
#define IFX_BMU_TID_TID0_LEN (4)

/** \\brief  Mask for Ifx_BMU_TID_Bits.TID0 */
#define IFX_BMU_TID_TID0_MSK (0xf)

/** \\brief  Offset for Ifx_BMU_TID_Bits.TID0 */
#define IFX_BMU_TID_TID0_OFF (0)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXBMU_BF_H */
